In [115]:
import pandas as pd 
import numpy as np

In [116]:
pd.Series([10,22,33,54,56])

0    10
1    22
2    33
3    54
4    56
dtype: int64

In [117]:
series = pd.Series([10,22,33,54,56])
type(series)

pandas.core.series.Series

In [118]:
series.axes

[RangeIndex(start=0, stop=5, step=1)]

In [119]:
series.dtype

dtype('int64')

In [120]:
series.size

5

In [121]:
series.ndim

1

In [122]:
series.values

array([10, 22, 33, 54, 56], dtype=int64)

In [123]:
series.head(3)

0    10
1    22
2    33
dtype: int64

In [124]:
series.tail(3)

2    33
3    54
4    56
dtype: int64

# Indexing

In [125]:
pd.Series([10,22,33,54,56], index = [1,3,5,7,9])

1    10
3    22
5    33
7    54
9    56
dtype: int64

In [126]:
pd.Series([10,22,33,54,56], index = ["a", "b", "c", "d", "e"])

a    10
b    22
c    33
d    54
e    56
dtype: int64

In [127]:
series = pd.Series([10,22,33,54,56], index = ["a", "b", "c", "d", "e"])

In [128]:
series["a"]

10

In [129]:
series["a": "c"]

a    10
b    22
c    33
dtype: int64

# creating pandas series from dictinories

In [130]:
dictionary = {"reg": 10, "log": 11, "cart": 12}
dictionary

{'reg': 10, 'log': 11, 'cart': 12}

In [131]:
dictSeries = pd.Series(dictionary)

In [132]:
dictSeries

reg     10
log     11
cart    12
dtype: int64

In [133]:
pd.concat([series, dictSeries], axis = 0)

a       10
b       22
c       33
d       54
e       56
reg     10
log     11
cart    12
dtype: int64

## Eleman İşlemleri

In [134]:
a = np.array([1,2,333,44,562, 14, 53])
series = pd.Series(a)
series

0      1
1      2
2    333
3     44
4    562
5     14
6     53
dtype: int32

In [135]:
series[0]

1

In [136]:
series[3]

44

In [137]:
series[0:3]

0      1
1      2
2    333
dtype: int32

In [138]:
series = pd.Series([12, 334, 2, 4, 51, 5, 1, 543, 14,], index=[
                   "a", "b", "c", "d", "e", "f", "g", "h", "i"])
series

a     12
b    334
c      2
d      4
e     51
f      5
g      1
h    543
i     14
dtype: int64

In [139]:
series.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'], dtype='object')

In [140]:
series.keys

<bound method Series.keys of a     12
b    334
c      2
d      4
e     51
f      5
g      1
h    543
i     14
dtype: int64>

In [141]:
list(series.items())

[('a', 12),
 ('b', 334),
 ('c', 2),
 ('d', 4),
 ('e', 51),
 ('f', 5),
 ('g', 1),
 ('h', 543),
 ('i', 14)]

In [142]:
"a" in series

True

In [143]:
#fancy eleman 
series[["a", "b"]]

a     12
b    334
dtype: int64

In [144]:
series["a"] = 999

In [145]:
series

a    999
b    334
c      2
d      4
e     51
f      5
g      1
h    543
i     14
dtype: int64

In [146]:
series["a": "c"]

a    999
b    334
c      2
dtype: int64

# Panda DataFrame

In [147]:
l = [1,2,3,4,5,6,7,8,9]
l

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [148]:
df = pd.DataFrame(l, columns = ["degisken_ismi"])
df

   degisken_ismi
0              1
1              2
2              3
3              4
4              5
5              6
6              7
7              8
8              9

In [149]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [150]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])

In [151]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [152]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [153]:
df.columns = ["deg1", "deg2", "deg3"]

In [154]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [155]:
type(df)

pandas.core.frame.DataFrame

In [156]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [157]:
df.shape

(3, 3)

In [158]:
df.size

9

In [159]:
df.ndim

2

In [160]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [161]:
type(df.values)

numpy.ndarray

In [162]:
df.head(2)

   deg1  deg2  deg3
0     1     2     3
1     4     5     6

In [163]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

In [164]:
s = np.random.randint(1, 30, size=(5, 3))
s

array([[18, 10, 15],
       [24,  9,  7],
       [ 5,  5, 27],
       [18,  4, 15],
       [24, 19,  3]])

In [165]:
df = pd.DataFrame(s, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    18    10    15
1    24     9     7
2     5     5    27
3    18     4    15
4    24    19     3

In [166]:
df[0:1]

   var1  var2  var3
0    18    10    15

In [167]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [168]:
df.index = ["a", "b", "c", "d", "e"]

In [169]:
df

   var1  var2  var3
a    18    10    15
b    24     9     7
c     5     5    27
d    18     4    15
e    24    19     3

# silme işlemi

In [170]:
df.drop("a", axis = 0)

   var1  var2  var3
b    24     9     7
c     5     5    27
d    18     4    15
e    24    19     3

In [171]:
df

   var1  var2  var3
a    18    10    15
b    24     9     7
c     5     5    27
d    18     4    15
e    24    19     3

In [172]:
df.drop("a", axis = 0, inplace = True)

In [173]:
df

   var1  var2  var3
b    24     9     7
c     5     5    27
d    18     4    15
e    24    19     3

In [174]:
# creating var3 from var1 * var2

df["var4"] = df["var1"] * df["var2"]

In [175]:
df

   var1  var2  var3  var4
b    24     9     7   216
c     5     5    27    25
d    18     4    15    72
e    24    19     3   456

In [176]:
df.drop("var4", axis = 1)

   var1  var2  var3
b    24     9     7
c     5     5    27
d    18     4    15
e    24    19     3

In [177]:
df

   var1  var2  var3  var4
b    24     9     7   216
c     5     5    27    25
d    18     4    15    72
e    24    19     3   456

In [178]:
df.drop("var4", axis=1, inplace=True)

In [179]:
df

   var1  var2  var3
b    24     9     7
c     5     5    27
d    18     4    15
e    24    19     3

# gözlem ve değişken seçimi: loc & iloc

In [180]:
m = np.random.randint(1, 30, size=(10, 3))
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    13    17    28
1    11    17    19
2    12    26    26
3    16    16    14
4    16     9    10
5    15     2    28
6    19     2    15
7     5    23     1
8    10    22    23
9     5     3     9

In [181]:
#loc: tanımlandığı şekli ile seçim yapmak için kullanılır.
df.loc[0:3]

   var1  var2  var3
0    13    17    28
1    11    17    19
2    12    26    26
3    16    16    14

In [182]:
#iloc: alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır.
df.iloc[0:3]

   var1  var2  var3
0    13    17    28
1    11    17    19
2    12    26    26

In [183]:
df.iloc[2:, 0:2]

   var1  var2
2    12    26
3    16    16
4    16     9
5    15     2
6    19     2
7     5    23
8    10    22
9     5     3

In [184]:
df

   var1  var2  var3
0    13    17    28
1    11    17    19
2    12    26    26
3    16    16    14
4    16     9    10
5    15     2    28
6    19     2    15
7     5    23     1
8    10    22    23
9     5     3     9

In [185]:
df.var1

0    13
1    11
2    12
3    16
4    16
5    15
6    19
7     5
8    10
9     5
Name: var1, dtype: int32

In [186]:
df.var1 > 15

0    False
1    False
2    False
3     True
4     True
5    False
6     True
7    False
8    False
9    False
Name: var1, dtype: bool

In [187]:
df[df.var1 > 15]

   var1  var2  var3
3    16    16    14
4    16     9    10
6    19     2    15

In [188]:
df[(df.var1 > 15) & (df.var3 < 15)] # aynı anda iki koşul

   var1  var2  var3
3    16    16    14
4    16     9    10

# birleştirme (Join) işlemi

In [189]:
m = np.random.randint(1, 30, size=(5, 3))
df1 = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df1

   var1  var2  var3
0    29    11    28
1     9    11     5
2    19    15    26
3     4     3     2
4    10     6    13

In [190]:
df2 = df1 + 99
df2

   var1  var2  var3
0   128   110   127
1   108   110   104
2   118   114   125
3   103   102   101
4   109   105   112

In [191]:
pd.concat([df1, df2], axis = 1)

   var1  var2  var3  var1  var2  var3
0    29    11    28   128   110   127
1     9    11     5   108   110   104
2    19    15    26   118   114   125
3     4     3     2   103   102   101
4    10     6    13   109   105   112

In [192]:
pd.concat([df1, df2], axis = 0, ignore_index=True)

   var1  var2  var3
0    29    11    28
1     9    11     5
2    19    15    26
3     4     3     2
4    10     6    13
5   128   110   127
6   108   110   104
7   118   114   125
8   103   102   101
9   109   105   112

In [193]:
df2.columns = ["var1", "var2", "deg3"]
df2

   var1  var2  deg3
0   128   110   127
1   108   110   104
2   118   114   125
3   103   102   101
4   109   105   112

In [194]:
df1.columns
df1

   var1  var2  var3
0    29    11    28
1     9    11     5
2    19    15    26
3     4     3     2
4    10     6    13

In [195]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    29    11  28.0    NaN
1     9    11   5.0    NaN
2    19    15  26.0    NaN
3     4     3   2.0    NaN
4    10     6  13.0    NaN
0   128   110   NaN  127.0
1   108   110   NaN  104.0
2   118   114   NaN  125.0
3   103   102   NaN  101.0
4   109   105   NaN  112.0

In [196]:
pd.concat([df1,df2], join = "inner")

   var1  var2
0    29    11
1     9    11
2    19    15
3     4     3
4    10     6
0   128   110
1   108   110
2   118   114
3   103   102
4   109   105

# ileri Birleştirme join işlemleri

In [197]:
df1 = pd.DataFrame({"calisanlar": ["Ali", "Veli", "Ayse", "Fatma"],
              "grup": ["Muhasebe", "Muhendislik", "Muhendislik", "IK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [198]:
df2 = pd.DataFrame({"calisanlar": ["Ayse", "Ali", "Veli", "Fatma"],
                    "işe_giris": [2010, 2009, 2014, 2019]})
df2

  calisanlar  işe_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [199]:
pd.merge(df1, df2, on='calisanlar')

  calisanlar         grup  işe_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [200]:
# çoktan teke birleştirme
df3 = pd.merge(df1, df2, on='calisanlar')
df3

  calisanlar         grup  işe_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [201]:
df4 = pd.DataFrame({"grup": ["Muhasebe", "Muhendislik", "IK"],
                    "mudur": ["Caner", "Mustafa", "Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [202]:
pd.merge(df3, df4, on="grup")

  calisanlar         grup  işe_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           IK       2019  Berkcan

In [203]:
df5 = pd.DataFrame({"grup": ["Muhasebe", "Muhasebe","muhendislik", "muhendislik", "IK", "IK"],
                    "yetenekler": ["matematik", "excel", "kodlama", "linux", "excel", "yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  muhendislik    kodlama
3  muhendislik      linux
4           IK      excel
5           IK    yonetim

In [204]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [205]:
pd.merge(df1, df5)

  calisanlar      grup yetenekler
0        Ali  Muhasebe  matematik
1        Ali  Muhasebe      excel
2      Fatma        IK      excel
3      Fatma        IK    yonetim

# Toplulastirma ve Gruplama (Aggregation & Grouping)
    Basit toplulastirma fonksiyonlları:
        • count ()
        • first()
        • last()
        • mean()
        • median()
        • min()
        • max()
        • stdO
        • var()
        • sum()

In [206]:
import seaborn as sns

df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [207]:
df.shape

(1035, 6)

In [208]:
df.size

6210

In [209]:
df.mean()

C:\Users\Lenova\AppData\Local\Temp\ipykernel_16648\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [210]:
df["mass"].mean()

2.6381605847953216

In [211]:
df["mass"].count()

513

In [212]:
df["mass"].max()

25.0

In [213]:
df["mass"].min()

0.0036

In [214]:
df["mass"].sum()

1353.37638

In [215]:
df["mass"].std()

3.8186166509616046

In [216]:
df["mass"].var()

14.58183312700122

In [217]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [218]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama işlemleri

In [219]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                    "veri": [10, 11, 52, 23, 43, 55]}, columns=["gruplar", "veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [220]:
df.groupby("gruplar")

In [221]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [222]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [223]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [224]:
df.groupby("method")

In [225]:
df.groupby("method")["orbital_period"]

In [226]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [227]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [228]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# aggregate, filter, transform, apply

In [230]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                    "degisken1": [10, 23, 33, 22, 11, 99],
                    "degisken2": [100, 253, 333, 262, 111, 969]}, columns=["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [232]:
# aggregate
df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [234]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [235]:
# filter 
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                    "degisken1": [10, 23, 33, 22, 11, 99],
                    "degisken2": [100, 253, 333, 262, 111, 969]}, columns=["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [236]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [237]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [250]:
# trasnform
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                    "degisken1": [10, 23, 33, 22, 11, 99],
                    "degisken2": [100, 253, 333, 262, 111, 969]}, columns=["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [239]:
df["degisken1"] * 9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [251]:
dfNew = df.iloc[:, 1:3]

In [253]:
dfNew.transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [254]:
dfNew.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [269]:
# apply
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                    "degisken1": [10, 23, 33, 22, 11, 99],
                    "degisken2": [100, 253, 333, 262, 111, 969]}, columns=["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [263]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [264]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [270]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

# pivot tablolar

In [271]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [273]:
# cinsiyete göre hayatta kalma oranı 
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [274]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [278]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [279]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [281]:
# pivot ile pivot table
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [282]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [284]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [287]:
titanic.pivot_table("survived", ["sex", age], columns="class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# reading data from outside

In [296]:
?pd.read_csv

Signature:
pd.read_csv(
    filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]',
    *,
    sep: 'str | None | lib.NoDefault' = <no_default>,
    delimiter: 'str | None | lib.NoDefault' = None,
    header: "int | Sequence[int] | None | Literal['infer']" = 'infer',
    names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>,
    index_col: 'IndexLabel | Literal[False] | None' = None,
    usecols=None,
    squeeze: 'bool | None' = None,
    prefix: 'str | lib.NoDefault' = <no_default>,
    mangle_dupe_cols: 'bool' = True,
    dtype: 'DtypeArg | None' = None,
    engine: 'CSVEngine | None' = None,
    converters=None,
    true_values=None,
    false_values=None,
    skipinitialspace: 'bool' = False,
    skiprows=None,
    skipfooter: 'int' = 0,
    nrows: 'int | None' = None,
    na_values=None,
    keep_default_na: 'bool' = True,
    na_filter: 'bool' = True,
    verbose: 'bool' = False,
    skip_blank_lines: 'bool' = True,
    parse_dates=None,
    infer_datetime_format: 'bool' = False,
    keep_date_col: 'bool' = False,
    date_parser=None,
    dayfirst: 'bool' = False,
    cache_dates: 'bool' = True,
    iterator: 'bool' = False,
    chunksize: 'int | None' = None,
    compression: 'CompressionOptions' = 'infer',
    thousands: 'str | None' = None,
    decimal: 'str' = '.',
    lineterminator: 'str | None' = None,
    quotechar: 'str' = '"',
    quoting: 'int' = 0,
    doublequote: 'bool' = True,
    escapechar: 'str | None' = None,
    comment: 'str | None' = None,
    encoding: 'str | None' = None,
    encoding_errors: 'str | None' = 'strict',
    dialect: 'str | csv.Dialect | None' = None,
    error_bad_lines: 'bool | None' = None,
    warn_bad_lines: 'bool | None' = None,
    on_bad_lines=None,
    delim_whitespace: 'bool' = False,
    low_memory=True,
    memory_map: 'bool' = False,
    float_precision: "Literal['high', 'legacy'] | None" = None,
    storage_options: 'StorageOptions' = None,
) -> 'DataFrame | TextFileReader'
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Delimiter to use. If sep is None, the C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator by Python's builtin sniffer
    tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
    different from ``'\s+'`` will be interpreted as regular expressions and
    will also force the use of the Python parsing engine. Note that regex
    delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, default ``None``
    Alias for sep.
header : int, list of int, None, default 'infer'
    Row number(s) to use as the column names, and the start of the
    data.  Default behavior is to infer the column names: if no names
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a multi-index on the columns
    e.g. [0,1,3]. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : array-like, optional
    List of column names to use. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : int, str, sequence of int / str, or False, optional, default ``None``
  Column(s) to use as the row labels of the ``DataFrame``, either given as
  string name or column index. If a sequence of int / str is given, a
  MultiIndex is used.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g. when you have a malformed file with delimiters at
  the end of each line.
usecols : list-like or callable, optional
    Return a subset of the columns. If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in `names` or
    inferred from the document header row(s). If ``names`` are given, the document
    header row(s) are not taken into account. For example, a valid list-like
    `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a DataFrame from ``data`` with element order preserved use
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
    in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to True. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
squeeze : bool, default False
    If the parsed data only contains one column then return a Series.

    .. deprecated:: 1.4.0
        Append ``.squeeze("columns")`` to the call to ``read_csv`` to squeeze
        the data.
prefix : str, optional
    Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...

    .. deprecated:: 1.4.0
       Use a list comprehension on the DataFrame's columns after calling ``read_csv``.
mangle_dupe_cols : bool, default True
    Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
    'X'...'X'. Passing in False will cause data to be overwritten if there
    are duplicate names in the columns.

    .. deprecated:: 1.5.0
        Not implemented, and a new argument to specify the pattern for the
        names of duplicated columns will be added instead
dtype : Type name or dict of column -> type, optional
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
    'c': 'Int64'}
    Use `str` or `object` together with suitable `na_values` settings
    to preserve and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.

    .. versionadded:: 1.5.0

        Support for defaultdict was added. Specify a defaultdict as input where
        the default determines the dtype of the columns which are not explicitly
        listed.
engine : {'c', 'python', 'pyarrow'}, optional
    Parser engine to use. The C and pyarrow engines are faster, while the python engine
    is currently more feature-complete. Multithreading is currently only supported by
    the pyarrow engine.

    .. versionadded:: 1.4.0

        The "pyarrow" engine was added as an *experimental* engine, and some features
        are unsupported, or may not work correctly, with this engine.
converters : dict, optional
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels.
true_values : list, optional
    Values to consider as True.
false_values : list, optional
    Values to consider as False.
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : list-like, int or callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (int)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning True if the row should be skipped and False otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with engine='c').
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : scalar, str, list-like, or dict, optional
    Additional strings to recognize as NA/NaN. If dict passed, specific
    per-column NA values.  By default the following values are interpreted as
    NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
    'nan', 'null'.
keep_default_na : bool, default True
    Whether or not to include the default NaN values when parsing the data.
    Depending on whether `na_values` is passed in, the behavior is as follows:

    * If `keep_default_na` is True, and `na_values` are specified, `na_values`
      is appended to the default NaN values used for parsing.
    * If `keep_default_na` is True, and `na_values` are not specified, only
      the default NaN values are used for parsing.
    * If `keep_default_na` is False, and `na_values` are specified, only
      the NaN values specified `na_values` are used for parsing.
    * If `keep_default_na` is False, and `na_values` are not specified, no
      strings will be parsed as NaN.

    Note that if `na_filter` is passed in as False, the `keep_default_na` and
    `na_values` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of na_values). In
    data without any NAs, passing na_filter=False can improve the performance
    of reading a large file.
verbose : bool, default False
    Indicate number of NA values placed in non-numeric columns.
skip_blank_lines : bool, default True
    If True, skip over blank lines rather than interpreting as NaN values.
parse_dates : bool or list of int or names or list of lists or dict, default False
    The behavior is as follows:

    * boolean. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    If a column or index cannot be represented as an array of datetimes,
    say because of an unparsable value or a mixture of timezones, the column
    or index will be returned unaltered as an object data type. For
    non-standard datetime parsing, use ``pd.to_datetime`` after
    ``pd.read_csv``. To parse an index or column with a mixture of timezones,
    specify ``date_parser`` to be a partially-applied
    :func:`pandas.to_datetime` with ``utc=True``. See
    :ref:`io.csv.mixed_timezones` for more.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If True and `parse_dates` is enabled, pandas will attempt to infer the
    format of the datetime strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.
keep_date_col : bool, default False
    If True and `parse_dates` specifies combining multiple columns then
    keep the original columns.
date_parser : function, optional
    Function to use for converting a sequence of string columns to an array of
    datetime instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. Pandas will try to call `date_parser` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by `parse_dates` into a single array
    and pass that; and 3) call `date_parser` once for each row using one or
    more strings (corresponding to the columns defined by `parse_dates`) as
    arguments.
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If True, use a cache of unique, converted dates to apply the datetime
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

    .. versionadded:: 0.25.0
iterator : bool, default False
    Return TextFileReader object for iteration or getting chunks with
    ``get_chunk()``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
chunksize : int, optional
    Return TextFileReader object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
compression : str or dict, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
    (otherwise no compression).
    If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
    Set to ``None`` for no decompression.
    Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'tar'``} and other
    key-value pairs are forwarded to
    ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, ``zstandard.ZstdDecompressor`` or
    ``tarfile.TarFile``, respectively.
    As an example, the following could be passed for Zstandard decompression using a
    custom compression dictionary:
    ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionadded:: 1.5.0
            Added support for `.tar` files.

    .. versionchanged:: 1.4.0 Zstandard support.

thousands : str, optional
    Thousands separator.
decimal : str, default '.'
    Character to recognize as decimal point (e.g. use ',' for European data).
lineterminator : str (length 1), optional
    Character to break file into lines. Only valid with C parser.
quotechar : str (length 1), optional
    The character used to denote the start and end of a quoted item. Quoted
    items can include the delimiter and it will be ignored.
quoting : int or csv.QUOTE_* instance, default 0
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
    QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
doublequote : bool, default ``True``
   When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive quotechar elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    One-character string used to escape other characters.
comment : str, optional
    Indicates remainder of line should not be parsed. If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter `header` but not by
    `skiprows`. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
    treated as the header.
encoding : str, optional
    Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    .. versionchanged:: 1.2

       When ``encoding`` is ``None``, ``errors="replace"`` is passed to
       ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
       This behavior was previously only the case for ``engine="python"``.

    .. versionchanged:: 1.3.0

       ``encoding_errors`` is a new argument. ``encoding`` has no longer an
       influence on how encoding errors are handled.

encoding_errors : str, optional, default "strict"
    How encoding errors are treated. `List of possible values
    <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

    .. versionadded:: 1.3.0

dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: `delimiter`, `doublequote`, `escapechar`,
    `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
    override values, a ParserWarning will be issued. See csv.Dialect
    documentation for more details.
error_bad_lines : bool, optional, default ``None``
    Lines with too many fields (e.g. a csv line with too many commas) will by
    default cause an exception to be raised, and no DataFrame will be returned.
    If False, then these "bad lines" will be dropped from the DataFrame that is
    returned.

    .. deprecated:: 1.3.0
       The ``on_bad_lines`` parameter should be used instead to specify behavior upon
       encountering a bad line instead.
warn_bad_lines : bool, optional, default ``None``
    If error_bad_lines is False, and warn_bad_lines is True, a warning for each
    "bad line" will be output.

    .. deprecated:: 1.3.0
       The ``on_bad_lines`` parameter should be used instead to specify behavior upon
       encountering a bad line instead.
on_bad_lines : {'error', 'warn', 'skip'} or callable, default 'error'
    Specifies what to do upon encountering a bad line (a line with too many fields).
    Allowed values are :

        - 'error', raise an Exception when a bad line is encountered.
        - 'warn', raise a warning when a bad line is encountered and skip that line.
        - 'skip', skip bad lines without raising or warning when they are encountered.

    .. versionadded:: 1.3.0

    .. versionadded:: 1.4.0

        - callable, function with signature
          ``(bad_line: list[str]) -> list[str] | None`` that will process a single
          bad line. ``bad_line`` is a list of strings split by the ``sep``.
          If the function returns ``None``, the bad line will be ignored.
          If the function returns a new list of strings with more elements than
          expected, a ``ParserWarning`` will be emitted while dropping extra elements.
          Only supported when ``engine="python"``

delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
    used as the sep. Equivalent to setting ``sep='\s+'``. If this option
    is set to True, nothing should be passed in for the ``delimiter``
    parameter.
low_memory : bool, default True
    Internally process the file in chunks, resulting in lower memory use
    while parsing, but possibly mixed type inference.  To ensure no mixed
    types either set False, or specify the type with the `dtype` parameter.
    Note that the entire file is read into a single DataFrame regardless,
    use the `chunksize` or `iterator` parameter to return the data in chunks.
    (Only valid with C parser).
memory_map : bool, default False
    If a filepath is provided for `filepath_or_buffer`, map the file object
    directly onto memory and access the data directly from there. Using this

In [291]:
df1 = pd.read_csv("reading_data\ornekcsv.csv", sep = ";")
df1

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [293]:
df2 = pd.read_csv("reading_data\duz_metin.txt")
df2

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [298]:
df3 = pd.read_excel("reading_data\ornekx.xlsx")
df3

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.